Revit 2027 API
FailureDefinitionRegistry Methods
The FailureDefinitionRegistry type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
FindFailureDefinition |  Finds a specific FailureDefinition by a given FailureDefinitionId.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ListAllFailureDefinitions |  Retrieves all the registered FailureDefinitions.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FailureDefinitionRegistry Class
Autodesk.Revit.DB Namespace